seaver-olson/comp445/rw612/boards/frdmrw612/tfm_examples/tfm_psatest/tfm_psatest_ns/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitFLASHPins(void)
{
    /* Initialize QUAD_SPI_FLASH functionality on pin GPIO_34, GPIO_28, GPIO_32, GPIO_33, GPIO_29, GPIO_31, GPIO_30
     * (pin E3_F4_F2_G3_D2_D3_F3) */
    IO_MUX_SetPinMux(IO_MUX_QUAD_SPI_FLASH);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPSRAMPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: B3, peripheral: FLEXSPI, signal: SRAM_CLK0, pin_signal: GPIO_35}
  - {pin_num: B2, peripheral: FLEXSPI, signal: SRAM_DQS, pin_signal: GPIO_37, pull_up_down: down}
  - {pin_num: B1, peripheral: FLEXSPI, signal: SRAM_DATA3, pin_signal: GPIO_41}
  - {pin_num: A1, peripheral: FLEXSPI, signal: SRAM_DATA2, pin_signal: GPIO_40}
  - {pin_num: B4, peripheral: FLEXSPI, signal: SRAM_SSEL0, pin_signal: GPIO_36}
  - {pin_num: C3, peripheral: FLEXSPI, signal: SRAM_DATA0, pin_signal: GPIO_38}
  - {pin_num: A2, peripheral: FLEXSPI, signal: SRAM_DATA1, pin_signal: GPIO_39}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPSRAMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPSRAMPins(void)
{
    /* Initialize QUAD_SPI_PSRAM functionality on pin GPIO_35, GPIO_37, GPIO_41, GPIO_40, GPIO_36, GPIO_38, GPIO_39
     * (pin B3_B2_B1_A1_B4_C3_A2) */
    IO_MUX_SetPinMux(IO_MUX_QUAD_SPI_PSRAM);
    /* Set GPIO_37 (pin B3_B2_B1_A1_B4_C3_A2) configuration - Enable pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(37U, IO_MUX_PinConfigPullDown);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
